<script setup lang="ts">
import { reactive, onMounted, inject } from "vue";
import { cx } from "@emotion/css";
import { useRouter } from "vue-router";

/************************************************************
 * Components
 ************************************************************/

/************************************************************
 * Style
 ************************************************************/
import { HeaderStyle } from "~/components/header/style/HeaderStyle";

/************************************************************
 * Utils, Constants...
 ************************************************************/
import { useUserStore } from "~/stores/useUserStore";

/************************************************************
 * Types, Interface
 ************************************************************/

/************************************************************
 * External Dependencies ( 외부 종속성 )
 ************************************************************/
const router = useRouter();

const { isLogin, logout } = useUserStore();

/************************************************************
 * Props
 ************************************************************/

/************************************************************
 * Emit
 ************************************************************/
const emit = defineEmits<{
  /**
   *
   */
  (eventName: ""): void;
}>();

/************************************************************
 * Raw Data ( 원시 데이터 )
 ************************************************************/

/************************************************************
 * Dynamic Data ( 동적 데이터 )
 ************************************************************/

/************************************************************
 * Provide / inject Data
 ************************************************************/

/************************************************************
 * Function
 ************************************************************/
// 로그인 페이지로 이동
const onLogin = () => {
  router.push("/login/login");
};

/************************************************************
 * Watch
 ************************************************************/

/************************************************************
 * Mounted
 ************************************************************/
onMounted(() => {});

/************************************************************
 * Layout
 ************************************************************/
</script>

<template>
  <div :class="cx('header', HeaderStyle.Default)">
    <div :class="cx('left', HeaderStyle.Left)"></div>

    <div :class="cx('center', HeaderStyle.Center)">
      <div :class="cx(HeaderStyle.Title)">
        <span>인천 항운 노조 양육반 관리 시스템</span>
      </div>
    </div>

    <div :class="cx('right', HeaderStyle.Right)">
      <v-btn
        v-if="!isLogin"
        :class="cx('login-btn')"
        :ripple="false"
        variant="text"
        @click="onLogin"
      >
        <span>로그인</span>
      </v-btn>

      <v-btn
        v-if="isLogin"
        :class="cx('logout-btn')"
        :ripple="false"
        variant="text"
        @click="logout"
      >
        <span>로그아웃</span>
        <span class="material-icons">logout</span>
      </v-btn>
    </div>
  </div>
</template>

<style lang="scss"></style>
